OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/spinandflash.c
#include <string.h>
#include <stdlib.h>
#include "NUC980.h"
#include "sys.h"
#include "etimer.h"
#include "usbd.h"
#include "fmi.h"
#include "sd.h"
#include "spinandflash.h"
#include "gpio.h"

#define TIMEOUT  1000000   /* unit of timeout is micro second */
#define QSPI_FLASH_PORT    QSPI0


extern void SetTimer(unsigned int count);
extern void DelayMicrosecond(unsigned int count);

extern SPINAND_INFO_T SNInfo, *pSN;
extern INFO_T info;

typedef struct {
    char PID;
    int (*SpiFlashWrite)(UINT32 address, UINT32 len, UCHAR *data);
} spiflash_t;



/********************
Function: Serial NAND continuous read to buffer
Argument:
addh~addl: Read data address
count: read count
return:
*********************/
void spiNAND_Continuous_Normal_Read(uint8_t* buff, uint32_t count)
{
    uint32_t volatile i = 0;
    spiNAND_CS_LOW();
    SPIin(0x03); // dummy
    SPIin(0x00); // dummy
    SPIin(0x00); // dummy
    SPIin(0x00); // dummy
    for( i = 0; i < count; i++) {
        *(buff+i) = SPIin(0x00);
    }
    spiNAND_CS_HIGH();
    return;
}

/********************
Function: W25M series (SPISTACK) die select
Argument:
    Select_die
        0x00  (power on default states)
        0x01
return:
*********************/
void spiNAND_Die_Select(uint8_t select_die)
{
    /*  reference code to avoid incorrect select die ID input
        switch(select_die){
          case 0x00:
            break;
          case 0x01:
            break;
          default:
            return;
        }
    */

    spiNAND_CS_LOW();
    SPIin(0xC2);        // Software Die Select
    SPIin(select_die);
    spiNAND_CS_HIGH();

    return;
}

/********************
Function: Serial NAND BBM Set LUT
Argument:
  LBA                   Logical block address
  PBA                   Physical block address
  * LBA or PBA          0       1       2
  * Page address        0       0x40   0x80
  return:
*********************/
void spiNAND_LUT_Set(uint16_t LBA, uint16_t PBA)
{
    spiNAND_CS_LOW();
    SPIin(0x06);
    spiNAND_CS_HIGH();

    spiNAND_CS_LOW();
    SPIin(0xA1);
    SPIin((LBA/0x100));
    SPIin((LBA%0x100));
    SPIin((PBA/0x100));
    SPIin((PBA%0x100));
    spiNAND_CS_HIGH();
}

/********************
Function: Serial NAND LUT read
Argument:
  uint16_t LBA[20];             Logical block address
  uint16_t PBA[20];             Physical block address
  For Winbond 1Gb NAND, LBA[9:0] & PBA [9:0] are effective block address. LBA[15:14] is used for additional information
return:
*********************/
void spiNAND_LUT_Read(uint16_t* LBA, uint16_t* PBA)
{
    uint16_t volatile i, buf1, buf2;
    spiNAND_CS_LOW();
    SPIin(0xA5);
    SPIin(0x00);                  // Dummy
    for(i = 0; i < 20; i++) {
        buf1 = SPIin(0x00);
        buf2 = SPIin(0x00);
        *(LBA+i) = (buf1 << 8) | buf2;
        buf1 = SPIin(0x00);
        buf2 = SPIin(0x00);
        *(PBA+i) = (buf1 << 8) | buf2;
    }
    spiNAND_CS_HIGH();
    return;
}

void spiNANDMarkBadBlock(uint32_t page_address)
{
    unsigned char data;

    spiNAND_BlockErase((page_address >> 16) & 0xFF, (page_address >> 8) & 0xFF, page_address & 0xFF);

    /* Set byte 2048 to 0xF0 */
    data = 0xF0;
    if(pSN->SPINand_ID == 0x2C242C)
        spiNAND_Pageprogram_Pattern(((page_address & (1 << 6)) ? (1 << 4) : 0) + 8, 0, &data, 1);
    else
        spiNAND_Pageprogram_Pattern(8, 0, &data, 1);
    spiNAND_Program_Excute((page_address >> 16) & 0xFF, (page_address >> 8) & 0xFF, page_address & 0xFF);

}

/********************\
Function: Serial NAND Bad block mark check
Argument:
return:
1: Check block is bad block.
0: Check block is not bad block.
update: V.1.0.8 // correct the bad block mark address
*********************/
uint8_t spiNAND_bad_block_check(uint32_t page_address)
{
    uint8_t volatile *read_buf;


    spiNAND_PageDataRead((page_address >> 16) & 0xFF, (page_address >> 8) & 0xFF, page_address & 0xFF); // Read the first page of a block
    if(pSN->SPINand_ID == 0x2C242C)
        spiNAND_Normal_Read(((page_address & (1 << 6)) ? (1 << 4) : 0) + 0x8, 0, read_buf, 1);
    else
        spiNAND_Normal_Read(0x8, 0x0, read_buf, 1); // Read bad block mark at 0x800 update at v.1.0.8
    if(*read_buf != 0xFF) { // update at v.1.0.7
        return 1;
    }

    if(pSN->SPINand_ID != 0xB148C8)
    {
        spiNAND_PageDataRead(((page_address+1) >> 16) & 0xFF, ((page_address+1) >> 8) & 0xFF, (page_address+1)& 0xFF); // Read the second page of a block
        if(pSN->SPINand_ID == 0x2C242C)
            spiNAND_Normal_Read((((page_address + 1) & (1 << 6)) ? (1 << 4) : 0) + 0x8, 0, read_buf, 1);
        else
            spiNAND_Normal_Read(0x8, 0x0, read_buf, 1); // Read bad block mark at 0x800 update at v.1.0.8
        if(*read_buf != 0xFF) { // update at v.1.0.7
            return 1;
        }
    }
    return 0;
}

/********************
Function: Program data verify
return:
0: no mismatch
1: mismatch
*********************/
uint8_t Program_verify(uint8_t* buff1, uint8_t* buff2, uint32_t count)
{
    uint32_t volatile i = 0;
    for( i = 0; i < count; i++) {
        if( *(buff1+i) != *(buff2+i)) {
            return 1;
        }
    }
    return 0;
}

/********************
Function: Serial NAND page program
Argument:
addh, addl: input address
program_buffer: input data
count: program count
return:
*********************/
void spiNAND_Pageprogram_Pattern(uint8_t addh, uint8_t addl, uint8_t* program_buffer, uint32_t count)
{
    uint32_t volatile i = 0;

    if(pSN->SPINand_ID != 0xB148C8)
    {
        spiNAND_CS_LOW();
        SPIin(0x06);
        spiNAND_CS_HIGH();
    
        spiNAND_CS_LOW();
        SPIin(0x02);
        SPIin(addh);
        SPIin(addl);
        for(i = 0; i < count; i++) {
            SPIin(*(program_buffer+i));
        }
        spiNAND_CS_HIGH();
    }
    else /* GD */
    { 
        spiNAND_CS_LOW();
        SPIin(0x02);
        SPIin(addh);
        SPIin(addl);
        for(i = 0; i < count; i++) {
            SPIin(*(program_buffer+i));
        }
        //printf("program_buffer[0]=0x%x\n", *program_buffer);
        spiNAND_CS_HIGH();
        spiNAND_CS_LOW();
        SPIin(0x06);
        spiNAND_CS_HIGH();
    }
    return;
}

