OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/spinandflash.c
/********************
Function: Serial NAND page program
Argument:
addh, addl: input address
pattern: program data
count: program count
return: ready busy count
*********************/
void spiNAND_Program_Excute(uint8_t Addr2, uint8_t Addr1, uint8_t Addr0)
{
    spiNAND_CS_LOW();
    /* Send command : Page program */
    SPIin(0x10);
    SPIin(Addr2);
    SPIin(Addr1);
    SPIin(Addr0);
    spiNAND_CS_HIGH();
    spiNAND_ReadyBusy_Check();

    return;
}

/********************
Function: Do whole Flash protect
Argument:
*********************/
void spiNAND_Protect()
{
    uint8_t volatile SR;
    SR = spiNAND_StatusRegister(1); // Read status register 2
    SR|=0x7C; // Enable ECC-E bit
    spiNAND_StatusRegister_Write_SR1(SR);
    return;
}

/********************
Function: Do whole Flash unprotect
Argument:
*********************/
void spiNAND_Unprotect()
{
    uint8_t volatile SR;
    SR = spiNAND_StatusRegister(1); // Read status register 2
    SR&=0x83; // Enable ECC-E bit
    spiNAND_StatusRegister_Write_SR1(SR);
    return;
}

/********************
Function: Check ECC-E status
Argument:
Comment: Change function name at V1.0.3
*********************/
uint8_t spiNAND_Check_Embedded_ECC_Enable()
{
    uint8_t volatile SR;
    SR = spiNAND_StatusRegister(2);  // Read status register 2
    return (SR&0x10)>>4;
}

/********************
Function: Check P-FAIL\E-FAIL status
Argument:
Comment: Modify this function at V1.0.3
*********************/
uint8_t spiNAND_Check_Program_Erase_Fail_Flag()
{
    uint8_t volatile SR;
    SR = spiNAND_StatusRegister(3); // Read status register 3
    return (SR&0x0C)>>2; // Check P-Fail, E-Fail bit
}

/********************
Function: Check ECC-1, ECC-0 status
Argument:
Comment: Add this function at V1.0.3
*********************/
uint8_t spiNAND_Check_Embedded_ECC_Flag()
{
    uint8_t volatile SR;
    SR = spiNAND_StatusRegister(3); // Read status register 3
    return (SR&0x30)>>4; // Check ECC-1, ECC0 bit
}

/********************
Function: Enable embedded ECC
Argument:
*********************/
void spiNAND_Enable_Embedded_ECC()
{
    uint8_t volatile SR;
    SR = spiNAND_StatusRegister(2); // Read status register 2
    SR|=0x10; // Enable ECC-E bit
    spiNAND_StatusRegister_Write_SR2(SR);
    return;
}

/********************
Function: Disable embedded ECC
Argument:
*********************/
void spiNAND_Disable_Embedded_ECC()
{
    uint8_t volatile SR;
    SR = spiNAND_StatusRegister(2); // Read status register 2
    SR&= 0xEF; // Disable ECC-E bit
    spiNAND_StatusRegister_Write_SR2(SR);
    return;
}

/********************
Function: Enable buffer mode
Argument:
*********************/
void spiNAND_Enable_Buffer_mode()
{
    uint8_t volatile SR;
    SR = spiNAND_StatusRegister(2); // Read status register 2
    SR|=0x08; // Enable BUF bit
    spiNAND_StatusRegister_Write_SR2(SR);
    return;
}

/********************
Function: Disable buffer mode
Argument:
*********************/
void spiNAND_Disable_Buffer_mode()
{
    uint8_t volatile SR;
    SR = spiNAND_StatusRegister(2); // Read status register 2
    SR&= 0xF7; // Disable BUF bit
    spiNAND_StatusRegister_Write_SR2(SR);
    return;
}

/********************
Function: Serial NAND Write Status register 1
Argument:
SR1: program SR1 data
*********************/
void spiNAND_StatusRegister_Write_SR1(uint8_t SR1)
{
    spiNAND_CS_LOW();
    if(pSN->SPINand_ID == 0xEFAA21)   /* winbond */
        SPIin(0x01);
    else
        SPIin(0x1f);
    SPIin(0xA0);
    SPIin(SR1);
    spiNAND_CS_HIGH();
    spiNAND_ReadyBusy_Check();
    return;
}

/********************
Function: Serial NAND Write Status register 2
Argument:
SR2: program SR2 data
*********************/
void spiNAND_StatusRegister_Write_SR2(uint8_t SR2)
{
    spiNAND_CS_LOW();
    SPIin(0x01);
    SPIin(0xB0);
    SPIin(SR2);
    spiNAND_CS_HIGH();
    spiNAND_ReadyBusy_Check();
    return;
}

/********************
Function: Serial NAND Write Status register 3
Argument:
 : select socket
SR3: program SR3 data
*********************/
void spiNAND_StatusRegister_Write_SR3(uint8_t SR3)
{
    spiNAND_CS_LOW();
    SPIin(0x01);
    SPIin(0xC0);
    SPIin(SR3);
    spiNAND_CS_HIGH();
    spiNAND_ReadyBusy_Check();
    return;
}

/********************
Function: Serial NAND Block erase
Argument:
PA_H, PA_L: Page address
return:
*********************/
void spiNAND_BlockErase(uint8_t Addr2, uint8_t Addr1, uint8_t Addr0)
{
    spiNAND_CS_LOW();
    SPIin(0x06);
    spiNAND_CS_HIGH();

    //__nop();
    spiNAND_CS_LOW();
    SPIin(0xD8);
    SPIin(Addr2);
    SPIin(Addr1);
    SPIin(Addr0);
    spiNAND_CS_HIGH();

    spiNAND_ReadyBusy_Check();
}

/********************
Function: Serial NAND Status register read
Argument:
sr_sel: select register
return: status register value
*********************/
uint8_t spiNAND_StatusRegister(uint8_t sr_sel)
{
    uint8_t volatile SR = 0;  // status register data
    switch(sr_sel) {
    case 0x01:
        spiNAND_CS_LOW();
        if(pSN->SPINand_ID == 0xEFAA21)   /* winbond */
            SPIin(0x05);
        else
            SPIin(0x0f);
        SPIin(0xA0); // SR1
        SR = SPIin(0x00);
        spiNAND_CS_HIGH();
        break;
    case 0x02:
        spiNAND_CS_LOW();
        SPIin(0x0F);
        SPIin(0xB0); // SR2
        SR = SPIin(0x00);
        spiNAND_CS_HIGH();
        break;
    case 0x03:
        spiNAND_CS_LOW();
        if(pSN->SPINand_ID == 0xEFAA21)   /* winbond */
            SPIin(0x05);
        else
            SPIin(0x0f);
        SPIin(0xC0); // SR3
        SR = SPIin(0x00);
        spiNAND_CS_HIGH();
        break;
    default:
        SR = 0xFF;
        break;
    }
    return SR;
}

/********************
Function: SPINAND page data read
Argument:
PA_H, page address
PA_L, page address
return:
*********************/
void spiNAND_PageDataRead(uint8_t Addr2, uint8_t Addr1, uint8_t Addr0)
{
    spiNAND_CS_LOW();
    /* Send command 0x13: Read data */
    SPIin(0x13); //
    SPIin(Addr2); // dummy
    SPIin(Addr1); // Page address
    SPIin(Addr0); // Page address
    spiNAND_CS_HIGH();
    spiNAND_ReadyBusy_Check(); // Need to wait for the data transfer.
    return;
}

