OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/spinandflash.c
/********************
Function: Serial NAND Normal read to buffer
Argument:
addh~addl: Read data address
count: read count
return:
*********************/
void spiNAND_Normal_Read(uint8_t addh, uint8_t addl, uint8_t* buff, uint32_t count)
{
    uint32_t volatile i = 0;

    if(pSN->SPINand_ID == 0xB148C8) /* GD */
    {
        spiNAND_CS_LOW();
        /* Send command 0x03: Read data */
        SPIin(0x03);
    
        SPIin(0x00); // dummy
        SPIin(addh);
        SPIin(addl);
    
        for( i = 0; i < count; i++) {
            *(buff+i) = SPIin(0x00);
        }
        spiNAND_CS_HIGH();
    }
    else{
        spiNAND_CS_LOW();
        /* Send command 0x03: Read data */
        SPIin(0x03);
    
        SPIin(addh);
        SPIin(addl);
        SPIin(0x00); // dummy
    
        for( i = 0; i < count; i++) {
            *(buff+i) = SPIin(0x00);
        }
        spiNAND_CS_HIGH();
    }
    return;
}

/********************
Function: Serial NAND Quad IO read to buffer
Argument:
addh~addl: Read data address
count: read count
return:
*********************/
void spiNAND_QuadIO_Read(uint8_t addh, uint8_t addl, uint8_t* buff, uint32_t count)
{
    uint32_t volatile i = 0;
    //printf("pSN->SPINand_QuadReadCmd=0x%x\n", pSN->SPINand_QuadReadCmd);
    spiNAND_CS_LOW();

    SPIin(pSN->SPINand_QuadReadCmd);
    SPIin(addh);
    SPIin(addl);
    SPIin(0x00); // dummy
    outpw(REG_SYS_GPD_MFPL, (inpw(REG_SYS_GPD_MFPL)& ~(0xFF000000)) | 0x11000000);

    QSPI0->CTL &= ~0x1;
    while (QSPI0->STATUS & 0x8000);
    QSPI_ENABLE_QUAD_INPUT_MODE(QSPI0);
    QSPI0->CTL |= 0x1;
    while ((QSPI0->STATUS & 0x8000) == 0);

    for( i = 0; i < count; i++) {
        *(buff+i) = SPIin(0x00);
    }
    spiNAND_CS_HIGH();

    QSPI0->CTL &= ~0x1;
    while (QSPI0->STATUS & 0x8000);
    QSPI_DISABLE_QUAD_MODE(QSPI0);
    QSPI0->CTL |= 0x1;
    while ((QSPI0->STATUS & 0x8000) == 0);

    outpw(REG_SYS_GPD_MFPL, inpw(REG_SYS_GPD_MFPL)& ~(0x11000000));

    PD->MODE = (PD->MODE & 0xFFFF0FFF) | 0x5000; /* Configure PD6 and PD7 as output mode */
    PD6 = 1; /* PD6: SPI0_MOSI1 or SPI flash /WP pin */
    PD7 = 1; /* PD7: SPI0_MISO1 or SPI flash /HOLD pin */

    return;
}

/********************
Function: Serial NAND Quad Output read to buffer
Argument:
addh~addl: Read data address
count: read count
return:
*********************/
void spiNAND_QuadOutput_Read(uint8_t addh, uint8_t addl, uint8_t* buff, uint32_t count)
{
    uint32_t u32RxCounter, u32TxCounter;

    /* Configure SPI0 related multi-function pins */
    outpw(REG_SYS_GPD_MFPL, (inpw(REG_SYS_GPD_MFPL) & (~0xFF000000)) | 0x11000000);

    /* /CS: active */
    spiNAND_CS_LOW();

    /* Send command */
    outpw(REG_QSPI0_TX, 0x6b);
    outpw(REG_QSPI0_TX, 0x00); // dummy
    outpw(REG_QSPI0_TX, 0x00); // dummy
    outpw(REG_QSPI0_TX, 0x00); // dummy

    /* Reset SPI RX */
    outpw(REG_QSPI0_FIFOCTL, inpw(REG_QSPI0_FIFOCTL)|0x1);
    while(inpw(REG_QSPI0_STATUS) & 0x800000);

    /* Enable Quad IO input mode */
    QSPI0->CTL &= ~0x1;
    while (QSPI0->STATUS & 0x8000);
    QSPI_ENABLE_QUAD_INPUT_MODE(QSPI0);
    QSPI0->CTL |= 0x1;
    while ((QSPI0->STATUS & 0x8000) == 0);

    outpw(REG_QSPI0_TX, 0);
    outpw(REG_QSPI0_TX, 0);
    u32RxCounter=0;
    u32TxCounter=2;
    while(u32RxCounter<count) {
        while((inpw(REG_QSPI0_STATUS)&0x100)==0) { // RX empty
            buff[u32RxCounter] = inpw(REG_QSPI0_RX);
            u32RxCounter++;
        }
        if( ((inpw(REG_QSPI0_STATUS)&0x20000)==0)&&(u32TxCounter<count)  ) { // TX full
            outpw(REG_QSPI0_TX, 0);
            u32TxCounter++;
        }
    }
    /* Check the BUSY flag */
    spiNAND_CS_HIGH();

    /* Disable Quad IO mode */
    QSPI0->CTL &= ~0x1;
    while (QSPI0->STATUS & 0x8000);
    QSPI_DISABLE_QUAD_MODE(QSPI0);
    QSPI0->CTL |= 0x1;

    outpw(REG_SYS_GPD_MFPL, inpw(REG_SYS_GPD_MFPL)& ~(0xFF000000));
    PD->MODE = (PD->MODE & 0xFFFF0FFF) | 0x5000; /* Configure PD6 and PD7 as output mode */
    PD6 = 1; /* PD6: SPI0_MOSI1 or SPI flash /WP pin */
    PD7 = 1; /* PD7: SPI0_MISO1 or SPI flash /HOLD pin */

    return;
}

/********************
Function: Serial NAND reset command
Argument:
return:
*********************/
void spiNAND_Reset()
{
    spiNAND_CS_LOW();
    SPIin(0xFF);
    spiNAND_CS_HIGH();
    spiNAND_ReadyBusy_Check();
}


/********************
Function: SPI NAND Ready busy check
Argument:
return:
*********************/
int8_t spiNAND_ReadyBusy_Check()
{
    uint8_t volatile SR = 0xFF;

    SetTimer(5000);
    if(pSN->SPINand_ID == 0xEFAA21) { /* winbond */
    //if(1){
        while((SR & 0x1) != 0x00) {
            spiNAND_CS_LOW();
            SPIin(0x0F);
            SPIin(0xC0);
            SR = SPIin(0x00);
            spiNAND_CS_HIGH();
            if (inpw(REG_ETMR0_ISR) & 0x1) {
                outpw(REG_ETMR0_ISR, 0x1);
                printf("Error winbond spiNAND_ReadyBusy_Check timeout\n");
                return 1;
            }
        }
    } else { // MXIC
        while((SR & 0x1) != 0x00) {
            spiNAND_CS_LOW();
            SPIin(0x0F);
            SPIin(0xC0);
            /* Check the BUSY flag */
            //while(inpw(REG_QSPI0_STATUS) & 0x1);
            SR = SPIin(0x00);
            spiNAND_CS_HIGH();

            if (inpw(REG_ETMR0_ISR) & 0x1) {
                outpw(REG_ETMR0_ISR, 0x1);
                printf("Error MXIC spiNAND_ReadyBusy_Check timeout\n");
                return 1;
            }
        }
    }

    return 0;
}

/********************
Function: read ID
Argument: cs sel
return: ID
*********************/
uint32_t spiNAND_ReadID()
{
    uint32_t JEDECID = 0;

    spiNAND_CS_LOW();
    SPIin(0x9F);
    SPIin(0x00); // dummy
    JEDECID += SPIin(0x00);

    if(JEDECID == 0xC2 || JEDECID == 0xC8) { 
        // MXIC Read ID BYTE0, BYTE1
        // GD, except 0xB148C8 which doesn't need the dummy after 0x9F
        JEDECID <<= 8;
        JEDECID += SPIin(0x00);
    } else {
        JEDECID <<= 8;
        JEDECID += SPIin(0x00);
        JEDECID <<= 8;
        JEDECID += SPIin(0x00);
    }
    spiNAND_CS_HIGH();
    return JEDECID;
}

