OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/spinandflash.c
/********************
Function: CS select low
Argument:
return:
*********************/
void spiNAND_CS_LOW()
{
    // /CS: active
    QSPI_SET_SS_LOW(QSPI0);
}

/********************
Function: CS select high
Argument:
return:
*********************/
void spiNAND_CS_HIGH()
{
    // /CS: de-active
    QSPI_SET_SS_HIGH(QSPI0);
}

/********************
Function: SPI hardware command send
Argument: DI: DI data
return: DO data
*********************/
uint8_t SPIin(uint8_t DI)
{
    QSPI_WRITE_TX(QSPI0, DI);
    while(QSPI_GET_RX_FIFO_EMPTY_FLAG(QSPI0));
    return (QSPI_READ_RX(QSPI0) & 0xff);
}

BOOL volatile _usbd_bIsSPINANDInit = FALSE;
int spiNANDInit()
{
    unsigned int volatile u32ReturnValue;

    /* select QSPI0 function pins */
    outpw(REG_CLK_PCLKEN1, (inpw(REG_CLK_PCLKEN1) | 0x10)); /* enable QSPI0 clock */
    outpw(REG_SYS_GPD_MFPL, 0x00111100);
    PD->MODE = (PD->MODE & 0xFFFF0FFF) | 0x5000; /* Configure PD6 and PD7 as output mode */
    PD6 = 1; /* PD6: SPI0_MOSI1 or SPI flash /WP pin */
    PD7 = 1; /* PD7: SPI0_MISO1 or SPI flash /HOLD pin */

    //outpw(REG_QSPI0_CLKDIV, 15);   /* Set SPI0 clock to 9.375 MHz => PCLK(150)/(n+1) */
    outpw(REG_QSPI0_CLKDIV, 2);   /* Set SPI0 clock to 50 MHz => PCLK(150)/(n+1) */

    /* Default setting: slave selection signal is active low; disable automatic slave selection function. */
    outpw(REG_QSPI0_SSCTL, 0); /* AUTOSS=0; low-active; de-select all SS pins. */
    /* Default setting: MSB first, disable unit transfer interrupt, SP_CYCLE = 15. */
    outpw(REG_QSPI0_CTL, 0x8F5); /* Data width 8 bits; MSB first; CLKP=0; TX_NEG=1; SPIEN=1. */

    memset((char *)&SNInfo, 0, sizeof(SPINAND_INFO_T));
    pSN = &SNInfo;

    //if (_usbd_bIsSPINANDInit == FALSE)
    {
        /* Disable auto SS function, control SS signal manually. */
        QSPI_DisableAutoSS(QSPI_FLASH_PORT);
        spiNAND_Reset();
        MSG_DEBUG("QSPI->CTL = 0x%x    QSPI->SSCTL = 0x%x   QSPI->CLKDIV = 0x%x\n", QSPI_FLASH_PORT->CTL, QSPI_FLASH_PORT->SSCTL, QSPI_FLASH_PORT->CLKDIV);

        if (spiNAND_ReadINFO(pSN)< 0)
            return Fail;

        // un-protect
        u32ReturnValue = spiNAND_StatusRegister(1);
        u32ReturnValue &= 0x83;
        spiNAND_StatusRegister_Write_SR1(u32ReturnValue);

        if(pSN->SPINand_IsDieSelect == 1)
        {
            spiNAND_Die_Select(SPINAND_DIE_ID1);
            u32ReturnValue = spiNAND_StatusRegister(1);
            MSG_DEBUG("ID1 SR1 =0x%x  ", u32ReturnValue);
            u32ReturnValue &= 0x83;
            MSG_DEBUG("0x%x\n", u32ReturnValue);
            spiNAND_StatusRegister_Write_SR1(u32ReturnValue);
        }

        _usbd_bIsSPINANDInit = TRUE;
    }

    return 0;
}

INT spiNAND_ReadINFO(SPINAND_INFO_T *pSN)
{
    pSN->SPINand_ID=spiNAND_ReadID();

    info.SPINand_IsDieSelect = 0;
    pSN->SPINand_IsDieSelect = 0;
    if(info.SPINand_uIsUserConfig == 1) {
        pSN->SPINand_ID = pSN->SPINand_ID;
        pSN->SPINand_PageSize = info.SPINand_PageSize;
        pSN->SPINand_SpareArea = info.SPINand_SpareArea ;
        pSN->SPINand_QuadReadCmd    = info.SPINand_QuadReadCmd;
        pSN->SPINand_ReadStatusCmd  = info.SPINand_ReadStatusCmd;
        pSN->SPINand_WriteStatusCmd = info.SPINand_WriteStatusCmd;
        pSN->SPINand_StatusValue    = info.SPINand_StatusValue;
        pSN->SPINand_dummybyte      = info.SPINand_dummybyte;
        pSN->SPINand_BlockPerFlash = info.SPINand_BlockPerFlash;
        pSN->SPINand_PagePerBlock = info.SPINand_PagePerBlock;
        pSN->SPINand_IsDieSelect = info.SPINand_IsDieSelect;
    } 
    else {
        //printf("spiNAND_ReadINFO   ID = 0x%x\n", pSN->SPINand_ID);
        if(pSN->SPINand_ID == 0xEFAA21) { /* winbond */
            pSN->SPINand_ID = 0xEFAA21;
            pSN->SPINand_PageSize=0x800; // 2048 bytes per page
            pSN->SPINand_SpareArea=0x40; // 64 bytes per page spare area
            //CMD_READ_QUAD_IO_FAST     0xeb, dummy 3
            //CMD_READ_QUAD_OUTPUT_FAST 0x6b, dummy 1
            pSN->SPINand_QuadReadCmd = 0x6b;
            pSN->SPINand_ReadStatusCmd = 0xff;
            pSN->SPINand_WriteStatusCmd =0xff;
            pSN->SPINand_StatusValue = 0xff;
            pSN->SPINand_dummybyte = 0x1;
            pSN->SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            pSN->SPINand_PagePerBlock = 64; // 64 pages per block

            info.SPINand_ID = 0xEFAA21;
            info.SPINand_PageSize=0x800; // 2048 bytes per page
            info.SPINand_SpareArea=0x40; // 64 bytes per page spare area
            info.SPINand_QuadReadCmd = 0x6b;
            info.SPINand_ReadStatusCmd = 0xff;
            info.SPINand_WriteStatusCmd =0xff;
            info.SPINand_StatusValue = 0xff;
            info.SPINand_dummybyte = 0x1;
            info.SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            info.SPINand_PagePerBlock = 64; // 64 pages per block
        } else if(pSN->SPINand_ID == 0xEFAA22){ /* winbond */
            pSN->SPINand_ID = 0xEFAA22;
            pSN->SPINand_PageSize=0x800; // 2048 bytes per page
            pSN->SPINand_SpareArea=0x40; // 64 bytes per page spare area
            //CMD_READ_QUAD_IO_FAST     0xeb, dummy 3
            //CMD_READ_QUAD_OUTPUT_FAST 0x6b, dummy 1
            pSN->SPINand_QuadReadCmd = 0x6b;
            pSN->SPINand_ReadStatusCmd = 0xff;
            pSN->SPINand_WriteStatusCmd =0xff;
            pSN->SPINand_StatusValue = 0xff;
            pSN->SPINand_dummybyte = 0x1;
            pSN->SPINand_BlockPerFlash = 0x800;// 1024 blocks per 1G NAND
            pSN->SPINand_PagePerBlock = 64; // 64 pages per block

            info.SPINand_ID = 0xEFAA22;
            info.SPINand_PageSize=0x800; // 2048 bytes per page
            info.SPINand_SpareArea=0x40; // 64 bytes per page spare area
            info.SPINand_QuadReadCmd = 0x6b;
            info.SPINand_ReadStatusCmd = 0xff; 
            info.SPINand_WriteStatusCmd =0xff;
            info.SPINand_StatusValue = 0xff;
            info.SPINand_dummybyte = 0x1;
            info.SPINand_BlockPerFlash = 0x800;// 1024 blocks per 1G NAND
            info.SPINand_PagePerBlock = 64; // 64 pages per block
        }else if(pSN->SPINand_ID == 0xEFAB21) { /* winbond W25M02GV(2x1G-bit), MCP(Multi Chip Package) */
            pSN->SPINand_ID = 0xEFAB21;
            pSN->SPINand_PageSize=0x800; // 2048 bytes per page
            pSN->SPINand_SpareArea=0x40; // 64 bytes per page spare area
            //CMD_READ_QUAD_IO_FAST     0xeb, dummy 3
            //CMD_READ_QUAD_OUTPUT_FAST 0x6b, dummy 1
            pSN->SPINand_QuadReadCmd = 0x6b;
            pSN->SPINand_ReadStatusCmd = 0xff;
            pSN->SPINand_WriteStatusCmd =0xff;
            pSN->SPINand_StatusValue = 0xff;
            pSN->SPINand_dummybyte = 0x1;
            pSN->SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            pSN->SPINand_PagePerBlock = 64; // 64 pages per block
            pSN->SPINand_IsDieSelect = 1; //W25M02GV(2 x 1G-bit), MCP(Multi Chip Package)

