OpenNuvoton/NUC980_NuWriter/NuWriterFW_BSP/source/spinandflash.c
            info.SPINand_ID = 0xEFAB21;
            info.SPINand_PageSize=0x800; // 2048 bytes per page
            info.SPINand_SpareArea=0x40; // 64 bytes per page spare area
            info.SPINand_QuadReadCmd = 0x6b;
            info.SPINand_ReadStatusCmd = 0xff;
            info.SPINand_WriteStatusCmd =0xff;
            info.SPINand_StatusValue = 0xff;
            info.SPINand_dummybyte = 0x1;
            info.SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            info.SPINand_PagePerBlock = 64; // 64 pages per block
            info.SPINand_IsDieSelect = 1; //W25M02GV(2 x 1G-bit), MCP (Multi Chip Package)
        } else if(pSN->SPINand_ID == 0xC212) { /* mxic */
            pSN->SPINand_ID = 0xC212;
            pSN->SPINand_PageSize=0x800; // 2048 bytes per page
            pSN->SPINand_SpareArea=0x40; // 64 bytes per page spare area
            pSN->SPINand_QuadReadCmd = 0x6b;
            pSN->SPINand_ReadStatusCmd = 0x05;
            pSN->SPINand_WriteStatusCmd =0x01;
            pSN->SPINand_StatusValue = 0x40;
            pSN->SPINand_dummybyte = 0x1;
            pSN->SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            pSN->SPINand_PagePerBlock = 64; // 64 pages per block

            info.SPINand_ID = 0xC212;
            info.SPINand_PageSize=0x800; // 2048 bytes per page
            info.SPINand_SpareArea=0x40;    // 64 bytes per page spare area
            info.SPINand_QuadReadCmd = 0x6b;
            info.SPINand_ReadStatusCmd = 0x05;
            info.SPINand_WriteStatusCmd =0x01;
            info.SPINand_StatusValue = 0x40;
            info.SPINand_dummybyte = 0x1;
            info.SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            info.SPINand_PagePerBlock = 64; // 64 pages per block

        } else  if(pSN->SPINand_ID == 0xbe20b || pSN->SPINand_ID == 0xbf20b) { /* XTX  2G */
            pSN->SPINand_ID = pSN->SPINand_ID;
            pSN->SPINand_PageSize=0x800; // 2048 bytes per page
            pSN->SPINand_SpareArea=0x40;    // 64 bytes per page spare area
            pSN->SPINand_QuadReadCmd = 0x6b;
            pSN->SPINand_ReadStatusCmd = 0xff;
            pSN->SPINand_WriteStatusCmd =0xff;
            pSN->SPINand_StatusValue = 0xff;
            pSN->SPINand_dummybyte = 0x1;
            pSN->SPINand_BlockPerFlash = 0x800;// 2048 blocks per 2G NAND
            pSN->SPINand_PagePerBlock = 64; // 64 pages per block

            info.SPINand_ID = pSN->SPINand_ID;
            info.SPINand_PageSize=0x800; // 2048 bytes per page
            info.SPINand_SpareArea=0x40;    // 64 bytes per page spare area
            info.SPINand_QuadReadCmd = 0x6b;
            info.SPINand_ReadStatusCmd = 0xff;
            info.SPINand_WriteStatusCmd =0xff;
            info.SPINand_StatusValue = 0xff;
            info.SPINand_dummybyte = 0x1;
            info.SPINand_BlockPerFlash= 0x800;// 2048 blocks per 2G NAND
            info.SPINand_PagePerBlock = 64; // 64 pages per block

        } else  if(pSN->SPINand_ID == 0xbe10b  || pSN->SPINand_ID == 0xbf10b ||
            pSN->SPINand_ID == 0xd511d5 || pSN->SPINand_ID == 0xd51cd5 ) { /* XTX/MK  1G */
            //pSN->SPINand_ID = 0xbe10b;
            pSN->SPINand_PageSize=0x800; // 2048 bytes per page
            pSN->SPINand_SpareArea=0x40;    // 64 bytes per page spare area
            pSN->SPINand_QuadReadCmd = 0x6b;
            pSN->SPINand_ReadStatusCmd = 0xff;
            pSN->SPINand_WriteStatusCmd =0xff;
            pSN->SPINand_StatusValue = 0xff;
            pSN->SPINand_dummybyte = 0x1;
            pSN->SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            pSN->SPINand_PagePerBlock = 64; // 64 pages per block

            info.SPINand_ID = pSN->SPINand_ID;//0xbe10b;
            info.SPINand_PageSize=0x800; // 2048 bytes per page
            info.SPINand_SpareArea=0x40;    // 64 bytes per page spare area
            info.SPINand_QuadReadCmd = 0x6b;
            info.SPINand_ReadStatusCmd = 0xff;
            info.SPINand_WriteStatusCmd =0xff;
            info.SPINand_StatusValue = 0xff;
            info.SPINand_dummybyte = 0x1;
            info.SPINand_BlockPerFlash= 0x400;// 1024 blocks per 1G NAND
            info.SPINand_PagePerBlock = 64; // 64 pages per block

        } else if(pSN->SPINand_ID == 0x9B129B) { /* ATO25D1GA */
            pSN->SPINand_ID = 0x9B129B;
            pSN->SPINand_PageSize=0x800; // 2048 bytes per page
            pSN->SPINand_SpareArea=0x40; // 64 bytes per page spare area
            pSN->SPINand_QuadReadCmd = 0x6b;
            pSN->SPINand_ReadStatusCmd = 0x0f;
            pSN->SPINand_WriteStatusCmd =0x1f;
            pSN->SPINand_StatusValue = 0x1;
            pSN->SPINand_dummybyte = 0x1;
            pSN->SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            pSN->SPINand_PagePerBlock = 64; // 64 pages per block

            info.SPINand_ID = 0x9B129B;
            info.SPINand_PageSize=0x800; // 2048 bytes per page
            info.SPINand_SpareArea=0x40;    // 64 bytes per page spare area
            info.SPINand_QuadReadCmd = 0x6b;
            info.SPINand_ReadStatusCmd = 0x0f;
            info.SPINand_WriteStatusCmd =0x1f;
            info.SPINand_StatusValue = 0x1;
            info.SPINand_dummybyte = 0x1;
            info.SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            info.SPINand_PagePerBlock = 64; // 64 pages per block
        }  else if(pSN->SPINand_ID == 0x2C242C) { /* MT29F2G01 */
            pSN->SPINand_ID = 0x2C242C;
            pSN->SPINand_PageSize=0x800; // 2048 bytes per page
            pSN->SPINand_SpareArea=0x80; // 128 bytes per page spare area
            pSN->SPINand_QuadReadCmd = 0x6b;
            pSN->SPINand_ReadStatusCmd = 0x0f;
            pSN->SPINand_WriteStatusCmd =0x1f;
            pSN->SPINand_StatusValue = 0x1;
            pSN->SPINand_dummybyte = 0x1;
            pSN->SPINand_BlockPerFlash = 0x800;// 2048 blocks per 1G NAND
            pSN->SPINand_PagePerBlock = 64; // 64 pages per block

            info.SPINand_ID = 0x2C242C;
            info.SPINand_PageSize=0x800; // 2048 bytes per page
            info.SPINand_SpareArea=0x80;    // 128 bytes per page spare area
            info.SPINand_QuadReadCmd = 0x6b;
            info.SPINand_ReadStatusCmd = 0x0f;
            info.SPINand_WriteStatusCmd =0x1f;
            info.SPINand_StatusValue = 0x1;
            info.SPINand_dummybyte = 0x1;
            info.SPINand_BlockPerFlash = 0x800;// 2048 blocks per 1G NAND
            info.SPINand_PagePerBlock = 64; // 64 pages per block
        } else if(pSN->SPINand_ID == 0xB148C8) { /* GD */
            pSN->SPINand_ID = 0xB148C8;
            pSN->SPINand_PageSize=0x800; // 2048 bytes per page
            pSN->SPINand_SpareArea=0x80; // 128 bytes per page spare area
            pSN->SPINand_QuadReadCmd = 0x6b;
            pSN->SPINand_ReadStatusCmd = 0x0f;
            pSN->SPINand_WriteStatusCmd =0x1f;
            pSN->SPINand_StatusValue = 0x1;
            pSN->SPINand_dummybyte = 0x1;
            pSN->SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            pSN->SPINand_PagePerBlock = 64; // 64 pages per block

            info.SPINand_ID = 0xB148C8;
            info.SPINand_PageSize=0x800; // 2048 bytes per page
            info.SPINand_SpareArea=0x80;    // 128 bytes per page spare area
            info.SPINand_QuadReadCmd = 0x6b;
            info.SPINand_ReadStatusCmd = 0x0f;
            info.SPINand_WriteStatusCmd =0x1f;
            info.SPINand_StatusValue = 0x1;
            info.SPINand_dummybyte = 0x1;
            info.SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            info.SPINand_PagePerBlock = 64; // 64 pages per block
        } else if (pSN->SPINand_ID == 0xC8D1){
            pSN->SPINand_ID = 0xC8D1;
            pSN->SPINand_PageSize=0x800; // 2048 bytes per page
            pSN->SPINand_SpareArea=0x80; // 128 bytes per page spare area
            pSN->SPINand_QuadReadCmd = 0x6b;
            pSN->SPINand_ReadStatusCmd = 0x0f;
            pSN->SPINand_WriteStatusCmd =0x1f;
            pSN->SPINand_StatusValue = 0x1;
            pSN->SPINand_dummybyte = 0x1;
            pSN->SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            pSN->SPINand_PagePerBlock = 64; // 64 pages per block

            info.SPINand_ID = 0xC8D1;
            info.SPINand_PageSize=0x800; // 2048 bytes per page
            info.SPINand_SpareArea=0x80;    // 128 bytes per page spare area
            info.SPINand_QuadReadCmd = 0x6b;
            info.SPINand_ReadStatusCmd = 0x0f;
            info.SPINand_WriteStatusCmd =0x1f;
            info.SPINand_StatusValue = 0x1;
            info.SPINand_dummybyte = 0x1;
            info.SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            info.SPINand_PagePerBlock = 64; // 64 pages per block
        } else if (pSN->SPINand_ID == 0xC851){
            pSN->SPINand_ID = 0xC851;
            pSN->SPINand_PageSize=0x800; // 2048 bytes per page
            pSN->SPINand_SpareArea=64; // 128 bytes per page spare area
            pSN->SPINand_QuadReadCmd = 0x6b;
            pSN->SPINand_ReadStatusCmd = 0x0f;
            pSN->SPINand_WriteStatusCmd =0x1f;
            pSN->SPINand_StatusValue = 0x1;
            pSN->SPINand_dummybyte = 0x1;
            pSN->SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            pSN->SPINand_PagePerBlock = 64; // 64 pages per block

            info.SPINand_ID = 0xC851;
            info.SPINand_PageSize=0x800; // 2048 bytes per page
            info.SPINand_SpareArea=64;    // 128 bytes per page spare area
            info.SPINand_QuadReadCmd = 0x6b;
            info.SPINand_ReadStatusCmd = 0x0f;
            info.SPINand_WriteStatusCmd =0x1f;
            info.SPINand_StatusValue = 0x1;
            info.SPINand_dummybyte = 0x1;
            info.SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            info.SPINand_PagePerBlock = 64; // 64 pages per block
        }else if (pSN->SPINand_ID == 0x98E240){
            pSN->SPINand_ID = 0x98E240;
            pSN->SPINand_PageSize=0x800; // 2048 bytes per page
            pSN->SPINand_SpareArea=64; // 128 bytes per page spare area
            pSN->SPINand_QuadReadCmd = 0x6b;
            pSN->SPINand_ReadStatusCmd = 0x0f;
            pSN->SPINand_WriteStatusCmd =0x1f;
            pSN->SPINand_StatusValue = 0x1;
            pSN->SPINand_dummybyte = 0x1;
            pSN->SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            pSN->SPINand_PagePerBlock = 64; // 64 pages per block

            info.SPINand_ID = 0x98E240;
            info.SPINand_PageSize=0x800; // 2048 bytes per page
            info.SPINand_SpareArea=64;    // 128 bytes per page spare area
            info.SPINand_QuadReadCmd = 0x6b;
            info.SPINand_ReadStatusCmd = 0x0f;
            info.SPINand_WriteStatusCmd =0x1f;
            info.SPINand_StatusValue = 0x1;
            info.SPINand_dummybyte = 0x1;
            info.SPINand_BlockPerFlash = 0x400;// 1024 blocks per 1G NAND
            info.SPINand_PagePerBlock = 64; // 64 pages per block
        } else {
            printf("SPI NAND ID 0x%x not support!! \n", pSN->SPINand_ID);
            pSN->SPINand_ID = 0x0;//pSN->SPINand_ID;
        }
    }
    return 0;
}

